{"class_name": "Model", "keras_version": "1.2.2", "config": {"output_layers": [["dense_3", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"input_dtype": "int32", "batch_input_shape": [null, 100], "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "embedding_1", "config": {"mask_zero": false, "W_constraint": null, "name": "embedding_1", "init": "uniform", "W_regularizer": null, "activity_regularizer": null, "output_dim": 100, "input_dtype": "int32", "trainable": true, "input_length": 100, "batch_input_shape": [null, 100], "dropout": 0.0, "input_dim": 142755}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convolution1d_1", "config": {"filter_length": 5, "W_constraint": null, "border_mode": "valid", "name": "convolution1d_1", "subsample_length": 1, "init": "glorot_uniform", "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_filter": 128, "b_constraint": null, "bias": true, "trainable": true, "input_length": null, "W_regularizer": null, "input_dim": null}, "inbound_nodes": [[["embedding_1", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "maxpooling1d_1", "config": {"border_mode": "valid", "trainable": true, "name": "maxpooling1d_1", "stride": 2, "pool_length": 2}, "inbound_nodes": [[["convolution1d_1", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "inbound_nodes": [[["maxpooling1d_1", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convolution1d_2", "config": {"filter_length": 5, "W_constraint": null, "border_mode": "valid", "name": "convolution1d_2", "subsample_length": 1, "init": "glorot_uniform", "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_filter": 128, "b_constraint": null, "bias": true, "trainable": true, "input_length": null, "W_regularizer": null, "input_dim": null}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "maxpooling1d_2", "config": {"border_mode": "valid", "trainable": true, "name": "maxpooling1d_2", "stride": 4, "pool_length": 4}, "inbound_nodes": [[["convolution1d_2", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "inbound_nodes": [[["maxpooling1d_2", 0, 0]]]}, {"class_name": "Convolution1D", "name": "convolution1d_3", "config": {"filter_length": 5, "W_constraint": null, "border_mode": "valid", "name": "convolution1d_3", "subsample_length": 1, "init": "glorot_uniform", "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_filter": 128, "b_constraint": null, "bias": true, "trainable": true, "input_length": null, "W_regularizer": null, "input_dim": null}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"class_name": "MaxPooling1D", "name": "maxpooling1d_3", "config": {"border_mode": "valid", "trainable": true, "name": "maxpooling1d_3", "stride": 7, "pool_length": 7}, "inbound_nodes": [[["convolution1d_3", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "inbound_nodes": [[["maxpooling1d_3", 0, 0]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "p": 0.25, "name": "dropout_4"}, "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"batch_input_shape": [null, 128], "output_dim": 128, "W_constraint": null, "name": "dense_1", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "activity_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "bias": true, "b_constraint": null, "input_dtype": "float32", "trainable": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.009999999776482582}, "input_dim": 128}, "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"trainable": true, "p": 0.25, "name": "dropout_5"}, "inbound_nodes": [[["dense_1", 0, 0]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"output_dim": 128, "W_constraint": null, "name": "dense_2", "b_regularizer": null, "init": "glorot_uniform", "activation": "relu", "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": 128}, "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_6", "config": {"trainable": true, "p": 0.2, "name": "dropout_6"}, "inbound_nodes": [[["dense_2", 0, 0]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"output_dim": 2, "W_constraint": null, "name": "dense_3", "b_regularizer": null, "init": "glorot_uniform", "activation": "softmax", "activity_regularizer": null, "b_constraint": null, "bias": true, "trainable": true, "W_regularizer": null, "input_dim": 128}, "inbound_nodes": [[["dropout_6", 0, 0]]]}], "input_layers": [["input_1", 0, 0]]}}