{"config": {"input_layers": [["input_1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 100], "input_dtype": "int32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"dropout": 0.0, "input_dtype": "int32", "name": "embedding_1", "trainable": true, "batch_input_shape": [null, 100], "output_dim": 100, "W_regularizer": null, "init": "uniform", "input_length": 100, "input_dim": 61877, "W_constraint": null, "activity_regularizer": null, "mask_zero": false}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "embedding_1", "class_name": "Embedding"}, {"config": {"bias": true, "W_regularizer": null, "name": "convolution1d_1", "trainable": true, "nb_filter": 128, "b_constraint": null, "input_length": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "subsample_length": 1, "filter_length": 5, "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "border_mode": "valid"}, "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "convolution1d_1", "class_name": "Convolution1D"}, {"config": {"trainable": true, "stride": 2, "border_mode": "valid", "name": "maxpooling1d_1", "pool_length": 2}, "inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "maxpooling1d_1", "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "inbound_nodes": [[["maxpooling1d_1", 0, 0]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"bias": true, "W_regularizer": null, "name": "convolution1d_2", "trainable": true, "nb_filter": 128, "b_constraint": null, "input_length": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "subsample_length": 1, "filter_length": 5, "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "border_mode": "valid"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution1d_2", "class_name": "Convolution1D"}, {"config": {"trainable": true, "stride": 4, "border_mode": "valid", "name": "maxpooling1d_2", "pool_length": 4}, "inbound_nodes": [[["convolution1d_2", 0, 0]]], "name": "maxpooling1d_2", "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "inbound_nodes": [[["maxpooling1d_2", 0, 0]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"bias": true, "W_regularizer": null, "name": "convolution1d_3", "trainable": true, "nb_filter": 128, "b_constraint": null, "input_length": null, "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "subsample_length": 1, "filter_length": 5, "activation": "relu", "activity_regularizer": null, "b_regularizer": null, "border_mode": "valid"}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution1d_3", "class_name": "Convolution1D"}, {"config": {"trainable": true, "stride": 7, "border_mode": "valid", "name": "maxpooling1d_3", "pool_length": 7}, "inbound_nodes": [[["convolution1d_3", 0, 0]]], "name": "maxpooling1d_3", "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "inbound_nodes": [[["maxpooling1d_3", 0, 0]]], "name": "dropout_3", "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"bias": true, "W_regularizer": null, "name": "dense_1", "trainable": true, "b_constraint": null, "output_dim": 128, "init": "glorot_uniform", "input_dim": 128, "W_constraint": null, "activation": "relu", "activity_regularizer": null, "b_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"bias": true, "W_regularizer": null, "name": "dense_2", "trainable": true, "b_constraint": null, "output_dim": 2, "init": "glorot_uniform", "input_dim": 128, "W_constraint": null, "activation": "softmax", "activity_regularizer": null, "b_regularizer": null}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2", "class_name": "Dense"}], "name": "model_1", "output_layers": [["dense_2", 0, 0]]}, "class_name": "Model", "keras_version": "1.2.2"}