{"keras_version": "1.2.2", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "input_dtype": "int32", "sparse": false, "batch_input_shape": [null, 100]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"name": "embedding_1", "output_dim": 100, "activity_regularizer": null, "batch_input_shape": [null, 100], "W_constraint": null, "dropout": 0.0, "input_dim": 141664, "trainable": true, "init": "uniform", "W_regularizer": null, "input_dtype": "int32", "mask_zero": false, "input_length": 100}, "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution1d_1", "config": {"init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 128, "subsample_length": 1, "W_constraint": null, "bias": true, "name": "convolution1d_1", "input_dim": null, "trainable": true, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "input_length": null, "activation": "relu", "b_regularizer": null, "filter_length": 5}, "class_name": "Convolution1D", "inbound_nodes": [[["embedding_1", 0, 0]]]}, {"name": "maxpooling1d_1", "config": {"name": "maxpooling1d_1", "stride": 2, "border_mode": "valid", "pool_length": 2, "trainable": true}, "class_name": "MaxPooling1D", "inbound_nodes": [[["convolution1d_1", 0, 0]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["maxpooling1d_1", 0, 0]]]}, {"name": "convolution1d_2", "config": {"init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 128, "subsample_length": 1, "W_constraint": null, "bias": true, "name": "convolution1d_2", "input_dim": null, "trainable": true, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "input_length": null, "activation": "relu", "b_regularizer": null, "filter_length": 5}, "class_name": "Convolution1D", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "maxpooling1d_2", "config": {"name": "maxpooling1d_2", "stride": 4, "border_mode": "valid", "pool_length": 4, "trainable": true}, "class_name": "MaxPooling1D", "inbound_nodes": [[["convolution1d_2", 0, 0]]]}, {"name": "dropout_2", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["maxpooling1d_2", 0, 0]]]}, {"name": "convolution1d_3", "config": {"init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 128, "subsample_length": 1, "W_constraint": null, "bias": true, "name": "convolution1d_3", "input_dim": null, "trainable": true, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "input_length": null, "activation": "relu", "b_regularizer": null, "filter_length": 5}, "class_name": "Convolution1D", "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "maxpooling1d_3", "config": {"name": "maxpooling1d_3", "stride": 7, "border_mode": "valid", "pool_length": 7, "trainable": true}, "class_name": "MaxPooling1D", "inbound_nodes": [[["convolution1d_3", 0, 0]]]}, {"name": "dropout_3", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["maxpooling1d_3", 0, 0]]]}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten", "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"name": "dropout_4", "config": {"name": "dropout_4", "p": 0.25, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"name": "dense_1", "config": {"name": "dense_1", "output_dim": 128, "activity_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "batch_input_shape": [null, 128], "W_constraint": null, "bias": true, "input_dim": 128, "trainable": true, "init": "glorot_uniform", "W_regularizer": {"name": "L1L2Regularizer", "l1": 0.0, "l2": 0.009999999776482582}, "b_constraint": null, "input_dtype": "float32", "activation": "linear", "b_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"name": "dropout_5", "config": {"name": "dropout_5", "p": 0.25, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"name": "dense_2", "config": {"name": "dense_2", "output_dim": 128, "activity_regularizer": null, "W_constraint": null, "bias": true, "input_dim": 128, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "activation": "relu", "b_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"name": "dropout_6", "config": {"name": "dropout_6", "p": 0.2, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"name": "dense_3", "config": {"name": "dense_3", "output_dim": 2, "activity_regularizer": null, "W_constraint": null, "bias": true, "input_dim": 128, "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "b_constraint": null, "activation": "softmax", "b_regularizer": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_6", 0, 0]]]}]}, "class_name": "Model"}